app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Biolog"], ["room_number", 123], ["created_at", "2021-01-14 18:40:09.741802"], ["updated_at", "2021-01-14 18:40:09.741802"]]
---
  def create
    @school_class = SchoolClass.new(school_class_params)
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Biology Winter 2020"], ["updated_at", "2021-01-14 18:42:03.866777"], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params)