app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @student = Student.find(params[:id])

INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-01-14 18:38:35.011974"], ["updated_at", "2021-01-14 18:38:35.011974"]]
---
  def create
    # byebug
    @student = Student.new(student_params)
    @student.save